import pandas as pd
import numpy as np

#生成数据函数，并且生成缺失值函数
def data1():
    data = pd.DataFrame(np.random.randn(6,4) , columns = ['harden','james','kobe','magee'])#生成6行4列的数据组
    '''
    运行结果为：
         harden     james      kobe     magee
        0  1.517025  2.004657  0.091689 -0.370361
        1  1.269137 -0.493641 -3.111204  0.713833
        2 -0.382447 -0.539409  3.096972 -0.705917
        3  0.395142  0.119778  1.737300  2.233014
        4 -0.208789  0.013375 -0.837241  0.703581
        5 -0.053064  0.446221  0.943206  1.934835
    '''
    #在两个地方生成缺失值
    data.iloc[1:2,1] = np.nan
    print(data)
    data.iloc[4,3] = np.nan
    print(data)
    '''
    运行结果如下：
         harden     james      kobe     magee
        0 -1.386308  0.217199  0.524414 -0.523686
        1 -0.100336       NaN -1.571599 -0.112793
        2 -1.966702  0.118629 -0.468932  1.174833
        3  0.914508 -0.583359 -0.050342  0.173656
        4  0.949096 -0.493106 -0.619377       NaN
        5 -0.141958 -0.686641  1.182189 -0.458995
    '''
data1()
